app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT * FROM "members" LIMIT 1

  def visual
    @members = Member.all.map! {|x| if x.visits.today!=[]; x end}
    if @members.any? {|x| x==nil}
---
SELECT * FROM "members"
SELECT * FROM "visits" WHERE ("visits".member_id = 1) AND (("visits".created_at BETWEEN '2010-09-13 15:00:00' AND '2010-09-14 01:00:00') AND ("visits".member_id = 1)) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM "visits" WHERE ((("visits".created_at BETWEEN '2010-09-01' AND '2010-09-30') AND ("visits".member_id = 1)) AND ("visits".member_id = 1))

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("name", "address", "created_at", "avatar_file_name", "avatar_file_size", "updated_at", "avatar_content_type", "phone", "avatar_updated_at", "coloft_id") VALUES('Josh', '', '2010-08-16 18:12:01', NULL, NULL, '2010-08-16 18:12:01', NULL, '', NULL, NULL)

  def update
    @member = Member.find(params[:id])

    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)
UPDATE "members" SET "updated_at" = '2010-08-16 03:35:29', "avatar_file_size" = 98911, "avatar_file_name" = '00 cover.jpg', "avatar_updated_at" = '2010-08-16 03:35:29', "avatar_content_type" = 'image/jpeg' WHERE "id" = 5

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT * FROM "members" WHERE ("members"."id" = 3)
DELETE FROM "members" WHERE "id" = 3