app/controllers/plans_controller.rb

SELECT * FROM "plans"
---
  def index
    @plans = Plan.all

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
---
  def show
    @plan = Plan.find(params[:id])

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
---
  def edit
    @plan = Plan.find(params[:id])

INSERT INTO "plans" ("name", "created_at", "updated_at") VALUES('Go wild', '2010-08-21 01:59:06', '2010-08-21 01:59:06')
---
  def create
    @plan = Plan.new(params[:plan])

    respond_to do |format|
      if @plan.save

SELECT * FROM "plans" WHERE ("plans"."id" = 1)
UPDATE "plans" SET "updated_at" = '2010-08-21 01:58:43', "name" = 'Drop-in & Community Membershipship' WHERE "id" = 1
---
  def update
    @plan = Plan.find(params[:id])

    respond_to do |format|
      if @plan.update_attributes(params[:plan])