app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('j2txTxuRVPlP70b8R5MC', '2010-08-16 02:13:10', '2010-08-16 02:13:10', '5d42a896464165d0926d0a77d18f1dc06cad5008932c714bee75879d04205b238a1784856e4b01cf76744b0a64a12db67e1acef16236e15ea1b731b27628778d', 'tDSfcKTdyAAZcJ58Nrm', '2010-08-16 02:13:10', 0, '127.0.0.1', 'cks4WCrjwbmkxhDLgKeZ', '2010-08-16 02:13:10', '1019ae70565c395c840a2e18f17661127b16be6310c7909b0a7ae15e43b7526d4e5b5d757ca69a5128f9c1f82ec227095b0ba8398c84d237e2f9728f99f1a5c5', 1, NULL, 'avesta', NULL, 'avesta@coloft.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "login_count" = 8, "persistence_token" = 'e7daa0f81f757d2df69f2027e7c338c277bcb8d39444ca86ce98c7f4f0a3fdec30b406ee118e7e7abf957d59255eeeba9da4f44eadb7f461bd72303806c1a391', "updated_at" = '2010-08-16 03:00:18', "perishable_token" = '5omOvECdwNhLr3bO1At', "last_request_at" = '2010-08-16 03:00:18', "last_login_at" = '2010-08-16 02:57:30', "current_login_at" = '2010-08-16 03:00:18', "password_salt" = '1yKFbhPTWZEoIqDsyz4Q', "crypted_password" = '04f6aab9556253f86aa831233032cdfd32cfc5f5d0a5bf18b167e24cc1a2a6c1856ff9b8b595898280c57cc8624794772cce12ed7340222f041f147413b10ae1' WHERE "id" = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
DELETE FROM "users" WHERE "id" = 5

  def index
    @users = User.all
---
SELECT * FROM "users"