app/controllers/visits_controller.rb

SELECT * FROM "members" WHERE ("members"."coloft_id" = '12') LIMIT 1
INSERT INTO "visits" ("created_at", "member_id", "updated_at", "coloft_id") VALUES('2010-09-13 18:55:22', 1, '2010-09-13 18:55:22', 1)
---
  def create

    if @member = Member.find_by_coloft_id(params[:coloft_id])
      @member.visits.create